#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.aws_ssm_parameter.main["account_alias"]: Reading...
data.aws_ssm_parameter.main["company_domain"]: Reading...
data.aws_ssm_parameter.main["company_name"]: Reading...
module.ec2_instance.aws_instance.app_server: Refreshing state... [id=i-06bf7a9ad26074276]
data.aws_ssm_parameter.main["account_alias"]: Read complete after 0s [id=/kasa-sus/kasa/account_alias]
data.aws_ssm_parameter.main["company_domain"]: Read complete after 0s [id=/kasa-sus/kasa/company_domain]
data.aws_ssm_parameter.main["company_name"]: Read complete after 0s [id=/kasa-sus/kasa/company_name]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ssm["ACCESSTOKEN"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ssm["API_KEYS_RETURNS"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ssm["API_SUPER_ADMIN_KEY"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ssm["AUTH_HASH_SECRET_RETURNS"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ssm["AUTH_TOKEN_EXPIRATION_TIME"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ssm["CORS_ENABLE"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ssm["CORS_KEY"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ssm["SWAGGER_USER"].aws_ssm_parameter.main will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = {
          + "managed_by_terraform" = "true"
          + "repository"           = "https://github.com/kasaconnect/kasa-infrastructure"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_region" but a value
was found in file "tfvars/dev.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/runner/work/kasa-infrastructure/kasa-infrastructure/kasa-infra/tfplan-dev-d96a569e051fc4c0abea02b5f308cc107794a3f1

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/kasa-infrastructure/kasa-infrastructure/kasa-infra/tfplan-dev-d96a569e051fc4c0abea02b5f308cc107794a3f1"

```
</details>

*Pusher: @Sachinc0201, Action: `pull_request`, Working Directory: `kasa-infra`, Environment: `dev`, Workflow (Plan): `Terraform Plan on Pull Request Opened/Updated`*